{
  "name": "Inbox [beta]",
  "identifier": "inbox",
  "script": "inbox.qml",
  "authors": ["@Maboroshy"],
  "platforms": ["linux", "macos", "windows"],
  "version": "0.0.1",
  "minAppVersion": "17.05.8",
  "description" : ["Inbox is a complex script to organize data you put to inbox folder from different devices and applications.",
  "",
  "<b>The script alters files in inbox folder you set. It's currently at beta stage, so using it for unrecoverable data is discouraged.</b>",
  "",
  "<b>Feature:</b>",
  "- The script turns all .txt files and files with no extension to .md note with modification time in the file name.",
  "- If there's a word that starts with a '@' (configurable) in file text, content of that file will be added to .md note named like that word. The content of .txt file with '@tag' in text will be added to 'tag.md' file.",
  "- Every URL in text file will be converted to markdown link, with web page favicon and title if possible.",
  "- Any image file placed to inbox folder will be moved to media folder. The script will put .md note with the in-line image instead.",
  "- Any other file placed to inbox folder will be moved to attachments folder. The script will put .md note with a link to the file instead. On Linux the file icon will be put before link.",
  "- Text/link of file placed to sub-folder of inbox folder will be added to .md note named like the sub-folder. Everything put to 'topic' sub-folder will be added to 'topic.md' file.",
  "- (Linux only) The script will put thumbnail for .pdf file as a link to it.",
  "- (Linux only) The script will replace large in-line images with a smaller ones as a link to original ones.",
  "",
  "<b>Dependencies:</b>",
  "<a href=\"https://www.python.org/downloads/\">Python 3.3+ Interpreter</a>;",
  "(Linux only, pdf thumbnails) ghostscript;",
  "(Linux only, image thumbnails) imagemagick;",
  "(Linux only, file icons) python-gobject.",
  "",
  "<b>Usage:</b>".
  "Run the script by toolbar button or menu item."]
} 
